erpdev.СХК_Расширение/src/DataProcessors/СХК_КорректировкаЯчеек/СХК_КорректировкаЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_КорректировкаЯчеек</name>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/AccumulationRegisters/СХК_ТоварыНаСкладе/СХК_ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СХК_ТоварыНаСкладе</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СХК_СкладЯчейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erpdev.СХК_Расширение/src/Documents/Расш1_ПоступлениеСклад/Расш1_ПоступлениеСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расш1_ПоступлениеСклад</name>
  <registerRecords>AccumulationRegister.СХК_ТоварыНаСкладе</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/DataProcessors/СХК_КорректировкаЯчеек/Forms/Форма/Module.bsl
&НаСервере
Процедура ВыполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	|	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	|	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка,
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток * (-1) КАК Количество,
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток * (-1) КАК КоличествоУпаковок
	|ИЗ
	|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(&ДатаОбработки) КАК СХК_ТоварыНаСкладеОстатки
	|ГДЕ
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток < 0";
	Запрос.УстановитьПараметр("ДатаОбработки",ТекущаяДата());	 
	//Запрос.УстановитьПараметр("Ячейка",Справочники.СХК_СкладЯчейки.НайтиПоНаименованию("Буфер"));
	
	Док = Документы.Расш1_ПоступлениеСклад.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	Док.Записать(РежимЗаписиДокумента.Запись);		 

	ЗапросБуфер = Новый Запрос;
	ЗапросБуфер.Текст = "ВЫБРАТЬ
	|	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	|	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	|	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка,
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток * (-1) КАК Количество,
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток * (-1) КАК КоличествоУпаковок
	|ИЗ
	|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(&ДатаОбработки,Ячейка =  &Ячейка) КАК СХК_ТоварыНаСкладеОстатки
	|ГДЕ
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток > 0";
	ЗапросБуфер.УстановитьПараметр("ДатаОбработки",ТекущаяДата());	 
	ЗапросБуфер.УстановитьПараметр("Ячейка",Справочники.СХК_СкладЯчейки.НайтиПоНаименованию("Буфер"));

	Док = Документы.Расш1_ПоступлениеСклад.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Товары.Загрузить(ЗапросБуфер.Выполнить().Выгрузить());
	Док.Записать(РежимЗаписиДокумента.Запись);		 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомманду(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры
